tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apache-arrow"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "dnsmasq"
brew "docutils"
brew "duckdb"
brew "editorconfig"
brew "erlang"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "pkg-config"
brew "hdf5"
brew "libarchive"
brew "proj"
brew "libgeotiff"
brew "libheif"
brew "libpq", link: true
brew "netcdf"
brew "numpy"
brew "openjpeg"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "grpcurl"
brew "harfbuzz"
brew "helix"
brew "helm"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "ispell"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "libgccjit"
brew "pango"
brew "librsvg"
brew "midnight-commander"
brew "neovim"
brew "neovide"
brew "ollama"
brew "pinentry-mac"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "pstree"
brew "pyenv"
brew "qemu"
brew "ripgrep"
brew "tmux"
brew "wordnet"
brew "zig"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-ctags", "with-native-comp", "with-poll"]
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "kitty"
cask "monitorcontrol"
cask "transmission"
cask "vlc"
