tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "apache-arrow"
brew "cmake"
brew "direnv"
brew "dnsmasq"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "python@3.11"
brew "docutils"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "hdf5"
brew "proj"
brew "libgeotiff"
brew "libheif"
brew "libpq", link: true
brew "netcdf"
brew "numpy"
brew "openjpeg"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "harfbuzz"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kerl"
brew "kubernetes-cli"
brew "libgccjit"
brew "librsvg"
brew "qemu"
brew "lima", args: ["HEAD"]
brew "midnight-commander"
brew "neovim"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "pyenv"
brew "ripgrep"
brew "tmux"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-emacs-big-sur-icon", "with-mac-metal", "with-native-comp"]
cask "blender"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "kitty"
cask "transmission"
cask "vlc"
