tap "anomalyco/tap"
tap "d12frosted/emacs-plus"
tap "oven-sh/bun"
brew "protobuf"
brew "llvm"
brew "awscli"
brew "bat"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "direnv"
brew "dnsmasq"
brew "editorconfig"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gnupg"
brew "libpq", link: true
brew "poppler"
brew "gdal"
brew "gh"
brew "git"
brew "go"
brew "grpcui"
brew "grpcurl"
brew "helix"
brew "helm"
brew "htop"
brew "ipython"
brew "ispell"
brew "kubernetes-cli"
brew "midnight-commander"
brew "neovim"
brew "nvm"
brew "ollama"
brew "pandoc"
brew "pgcli"
brew "pinentry-mac"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "uv"
brew "zls"
brew "anomalyco/tap/opencode"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-ctags", "with-imagemagick"]
brew "oven-sh/bun/bun"
cask "antigravity"
cask "antigravity-cli"
cask "aws-vpn-client"
cask "flutter"
cask "font-iosevka"
cask "font-iosevka-slab"
cask "gcloud-cli"
cask "ghostty@tip"
cask "transmission"
cask "vlc"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
npm "corepack"
